[
  {
    "title": "Tomorrow's Schedule & New Habit Start",
    "description": "Manage a critical meeting, finalize a senior application plan by tomorrow's deadline, and establish a new daily oral hygiene habit.",
    "status": "draft",
    "tasks": [
      "zthlen7nxmj03tnr959asdm",
      "h4ic2pfmz17am446q4inav",
      "4w245v7wcasm5lo2gak0km"
    ],
    "goal": "Hey",
    "constraints": {},
    "id": "ae3hrbc26u55mp2ow7ctmp",
    "createdAt": "2026-01-26T00:44:21.836Z",
    "updatedAt": "2026-01-26T00:44:21.863Z"
  },
  {
    "title": "App Feature Development & Integration Roadmap",
    "description": "Develop core app features including notification and third-party integrations, advanced task management (CRUD, archiving, filtering), memory support, conversation handling, lead management, and cron job automation.",
    "status": "draft",
    "tasks": [
      "1mrpzcbvab5nph0r7frn",
      "s8nrkcmjwnbk9l58vaf99",
      "22q1aislq8je1zvml59g9o",
      "psjr98r05ydurgotlkqpsh",
      "h2x225h94uvsxb6ss6htvc",
      "1zd8nzkcy2myl13c6uw6l",
      "q9r1okfaf3pa3f7xd1g3ji",
      "qydepqtw0xnpg4wsvywvh",
      "3gafajv859h0435icsaw5h",
      "fot5aiasxycs6ydbh1vn3q",
      "by8ao4auf5wsn7tfe2jtgd",
      "3gny4s7subw5l64g3kosab"
    ],
    "goal": "yeah so I want the following to happen I want number one which is all of the following tasks they are for this app which was notification support whatsapp support email support click up support later there's going to be other types of support like uh not to push notifications for website um long versus short uh conversations uh memory support where you can look at the memories being saved and prioritize it um you also have what else what else do you have you have just those for now I think are enough there was a few other ones in my mind there's also the lead support create update support for the tasks themselves when a task is deleted you can filter them like you can only show you only show the ones that are active you don't show the words that are in the past and have finished or have not have not been completed by in the past but they are still available for you to see later so just because it's it's deleted but it's more of an archive not an actual delete there is also so yeah these are like the ones I'm supporting at the moment it's going to be others but you also cron job support where you can ask the AI to do something as a cron job for each of these integrations I talked about hard push reminders access to other apps later and so on and so forth okay",
    "constraints": {},
    "id": "rmwb15w0mnqoi31dxcn4yg",
    "createdAt": "2026-01-26T01:55:20.013Z",
    "updatedAt": "2026-01-26T01:55:20.054Z"
  },
  {
    "title": "Teeth Reminder",
    "description": "Set a reminder to think about teeth in 30 minutes.",
    "status": "draft",
    "tasks": [
      "4z6udymidki9hhoxlsjj97"
    ],
    "goal": "hey , remind me in 30 mins about teeth",
    "constraints": {},
    "id": "usac6g5fvrlpbk3211ij1",
    "createdAt": "2026-01-26T17:42:17.830Z",
    "updatedAt": "2026-01-26T17:42:17.840Z"
  },
  {
    "title": "Snoonu Trial Cancellation Reminder",
    "description": "Set a reminder for 12 days from now to cancel the Snoonu trial subscription before the free period ends.",
    "status": "draft",
    "tasks": [
      "z2l169xmy7623rkxnrwtn"
    ],
    "goal": "remind me in 12 days to cancel my snoonu trial",
    "constraints": {},
    "id": "wp8lm86fksi1cpciukkom3k",
    "createdAt": "2026-01-26T17:43:12.780Z",
    "updatedAt": "2026-01-26T17:43:12.791Z"
  },
  {
    "title": "New App Features & Personal Admin",
    "description": "Integrate advanced time management and project support into the app, plan for its architectural transition, and manage a personal subscription cancellation.",
    "status": "draft",
    "tasks": [
      "n61oo57wii9fix0jeoqc2",
      "fet3pk2ik9or9wqmww3qa",
      "8kxmah4i14613qf9yetiy3",
      "wbs9wuqpd1lnbf7nwlax9p"
    ],
    "goal": "Okay, so I would also like to make the app a wrapper or an app later, so that's a task. Another task would be for me to cancel my subscription for Google on the 24th of February. I would also like to add the ability for the time aspect of the tasks so if they are to-dos we have due dates if they are habits or reminders they have specific times when they're added when been repeated and more also a last task could be project support",
    "constraints": {},
    "id": "6zkxx6oor7826vbsjye8wm",
    "createdAt": "2026-01-26T17:51:00.200Z",
    "updatedAt": "2026-01-26T17:51:00.217Z"
  }
]